JeffTheStig/AudioCat_Seminar/Audiocat_PlatformIO_base/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Nucleo 144 boards

Nucleo_144.name=Nucleo-144
Nucleo_144.build.core=arduino
Nucleo_144.build.board=Nucleo_144
Nucleo_144.build.variant_h=variant_{build.board}.h
Nucleo_144.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_144.build.flash_offset=0x0
Nucleo_144.upload.maximum_size=0
Nucleo_144.upload.maximum_data_size=0

# NUCLEO_U5A5ZJ board
Nucleo_144.menu.pnum.nucleo_u5a5zj=Nucleo U5A5ZJ
Nucleo_144.menu.pnum.nucleo_u5a5zj.node=NODE_U5A5ZJ
Nucleo_144.menu.pnuw.nucleo_u5a5zj.upload.maximum_size=262144
Nucleo_144.menu.pnuw.nucleo_u5a5zj.upload.maximum_data_size=2097152
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.mcu=cortex-m33
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.board=NUCLEO_U5A5ZJ
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.series=STM32U5xx
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.product_line=STM32U5A5xx
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.variant=STM32U5A5ZJTxQ
Nucleo_144.menu.pnum.nucleo_u5a5zj.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# NUCLEO_U5A5ZJ board
Nucleo_144.menu.pnum.audiocatboard=AudioCatBoard
Nucleo_144.menu.pnum.audiocatboard.node=AudioCatBoard
Nucleo_144.menu.pnuw.audiocatboard.upload.maximum_size=262144
Nucleo_144.menu.pnuw.audiocatboard.upload.maximum_data_size=2097152
Nucleo_144.menu.pnum.audiocatboard.build.mcu=cortex-m33
Nucleo_144.menu.pnum.audiocatboard.build.board=NUCLEO_U5A5ZJ
Nucleo_144.menu.pnum.audiocatboard.build.series=STM32U5xx
Nucleo_144.menu.pnum.audiocatboard.build.product_line=STM32U5A9xx
Nucleo_144.menu.pnum.audiocatboard.build.variant=STM32U5A9ZJTxQ
Nucleo_144.menu.pnum.audiocatboard.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
Nucleo_144.menu.upload_method.MassStorage=Mass Storage
Nucleo_144.menu.upload_method.MassStorage.upload.protocol=
Nucleo_144.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_144.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_144.menu.upload_method.swdMethod.upload.protocol=0
Nucleo_144.menu.upload_method.swdMethod.upload.options=
Nucleo_144.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Nucleo_144.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_144.menu.upload_method.serialMethod.upload.protocol=1
Nucleo_144.menu.upload_method.serialMethod.upload.options={serial.port.file}
Nucleo_144.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_144.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_144.menu.upload_method.dfuMethod.upload.protocol=2
Nucleo_144.menu.upload_method.dfuMethod.upload.options=
Nucleo_144.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic U5
GenU5.name=Generic STM32U5 series

GenU5.build.core=arduino
GenU5.build.board=GenU5
GenU5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenU5.build.mcu=cortex-m33
GenU5.build.fpu=-mfpu=fpv4-sp-d16
GenU5.build.float-abi=-mfloat-abi=hard
GenU5.build.series=STM32U5xx
GenU5.build.flash_offset=0x0
GenU5.upload.maximum_size=0
GenU5.upload.maximum_data_size=0

# Generic U5A5ZJTxQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ=Generic U5A5ZJTxQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.upload.maximum_size=4194304
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.upload.maximum_data_size=2574336
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.board=GENERIC_U5A5ZJTXQ
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.product_line=STM32U5A5xx
GenU5.menu.pnum.GENERIC_U5A5ZJTXQ.build.variant=STM32U5xx/U5A5ZJTxQ_U5A9ZLTxQ

# Generic U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ=Generic U5A9ZJTxQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.upload.maximum_size=4194304
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.upload.maximum_data_size=2574336
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.board=GENERIC_U5A9ZJTXQ
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.product_line=STM32U5A9xx
GenU5.menu.pnum.GENERIC_U5A9ZJTXQ.build.variant=STM32U5xx/U5A5ZJTxQ_U5A9ZLTxQ

# Upload menu
GenU5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU5.menu.upload_method.swdMethod.upload.protocol=0
GenU5.menu.upload_method.swdMethod.upload.options=
GenU5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU5.menu.upload_method.serialMethod.upload.protocol=1
GenU5.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenU5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU5.menu.upload_method.dfuMethod.upload.protocol=2
GenU5.menu.upload_method.dfuMethod.upload.options=
GenU5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

# USB connectivity
Nucleo_144.menu.usb.none=None
Nucleo_144.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_144.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_144.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_144.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_144.menu.usb.HID=HID (keyboard and mouse)
Nucleo_144.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Nucleo_144.menu.xusb.FS=Low/Full Speed
Nucleo_144.menu.xusb.HS=High Speed
Nucleo_144.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_144.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_144.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenU5.menu.usb.none=None
GenU5.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenU5.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenU5.menu.usb.CDC=CDC (no generic 'Serial')
GenU5.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenU5.menu.usb.HID=HID (keyboard and mouse)
GenU5.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenU5.menu.xusb.FS=Low/Full Speed
GenU5.menu.xusb.HS=High Speed
GenU5.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenU5.menu.xusb.HSFS=High Speed in Full Speed mode
GenU5.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.ogstd=Debug (-Og)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_144.menu.opt.o0std=No Optimization (-O0)
Nucleo_144.menu.opt.o0std.build.flags.optimize=-O0

GenU5.menu.opt.osstd=Smallest (-Os default)
GenU5.menu.opt.osstd.build.flags.optimize=-Os
GenU5.menu.opt.oslto=Smallest (-Os) with LTO
GenU5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU5.menu.opt.o1std=Fast (-O1)
GenU5.menu.opt.o1std.build.flags.optimize=-O1
GenU5.menu.opt.o1lto=Fast (-O1) with LTO
GenU5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU5.menu.opt.o2std=Faster (-O2)
GenU5.menu.opt.o2std.build.flags.optimize=-O2
GenU5.menu.opt.o2lto=Faster (-O2) with LTO
GenU5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU5.menu.opt.o3std=Fastest (-O3)
GenU5.menu.opt.o3std.build.flags.optimize=-O3
GenU5.menu.opt.o3lto=Fastest (-O3) with LTO
GenU5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU5.menu.opt.ogstd=Debug (-Og)
GenU5.menu.opt.ogstd.build.flags.optimize=-Og
GenU5.menu.opt.o0std=No Optimization (-O0)
GenU5.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_144.menu.dbg.enable_log=Core logs Enabled
Nucleo_144.menu.dbg.enable_log.build.flags.debug=
Nucleo_144.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_all.build.flags.debug=-g

GenL5.menu.dbg.none=None
GenL5.menu.dbg.enable_sym=Symbols Enabled (-g)
GenL5.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenL5.menu.dbg.enable_log=Core logs Enabled
GenL5.menu.dbg.enable_log.build.flags.debug=
GenL5.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenL5.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

GenU5.menu.rtlib.nano=Newlib Nano (default)
GenU5.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenU5.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenU5.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenU5.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenU5.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenU5.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenU5.menu.rtlib.full=Newlib Standard
GenU5.menu.rtlib.full.build.flags.ldspecs=
